{
	"name": "Streadata.io API Gallery - Changes",
	"description": "This is a repository of changes APIs, self-contained as a Github repository, with HTML and YAML representations of the APIs and their surrounding operations.",
	"image": "http://template.streamdata.gallery/assets/changes.png",
	"created": "2018-02-24",
	"modified": "2018-08-27",
	"url": "http://changes.streamdata.gallery/apis.json",
	"specificationVersion": "0.14",
	"apis": [
		{
			"name": "Context.IO",
			"x-api-slug": "context-io",
			"description": "Create simple email webhooks and code against a free, RESTful, IMAP API.",
			"image": "http://kinlane-productions.s3.amazonaws.com/screen-capture-api/172-context-io.jpg",
			"humanURL": "http://context.io/",
			"baseURL": "https://api.context.io//2.0/",
			"tags": "Changes",
			"properties": [
				{
					"type": "x-openapi-spec",
					"url": "https://raw.githubusercontent.com/streamdata-gallery-topics/changes/master/_listings/context-io/openapi.md"
				}
			]
		},
		{
			"name": "Xignite",
			"x-api-slug": "xignite",
			"description": "Financial market data on-demand. Xignite financial Web services help build smarter websites and applications in minutes with zero up-front investment.",
			"image": "http://kinlane-productions.s3.amazonaws.com/api-evangelist-site/company/logos/xignite-logo.png",
			"humanURL": "http://www.xignite.com",
			"baseURL": "https://www.xignite.com/xVWAP.json/XigniteVWAP",
			"tags": "Changes",
			"properties": [
				{
					"type": "x-openapi-spec",
					"url": "https://raw.githubusercontent.com/streamdata-gallery-topics/changes/master/_listings/xignite/openapi.md"
				}
			]
		},
		{
			"name": "UK National Archives",
			"x-api-slug": "uk-national-archives",
			"description": "The National Archives (TNA) is a non-ministerial government department. Its parent department is the Department for Culture, Media and Sport of the United Kingdom of Great Britain and Northern Ireland. It is the official archive of the UK government and for England and Wales; and guardian of some of the nations most iconic documents, dating back more than 1,000 years. There are separate national archives for Scotland (the National Records of Scotland) and Northern Ireland (the Public Record Office of Northern Ireland).",
			"image": "http://kinlane-productions.s3.amazonaws.com/api-evangelist-site/company/logos/uk-national-archives.jpeg",
			"humanURL": "http://discovery.nationalarchives.gov.uk/SearchUI/api.htm",
			"baseURL": "https://api.gettyimages.com//",
			"tags": "Changes",
			"properties": [
				{
					"type": "x-openapi-spec",
					"url": "https://raw.githubusercontent.com/streamdata-gallery-topics/changes/master/_listings/uk-national-archives/openapi.md"
				}
			]
		},
		{
			"name": "Getty Images",
			"x-api-slug": "getty-images",
			"description": "Find high resolution royalty-free images, editorial stock photos, vector art, video footage clips and stock music licensing at the richest image search photo library online.",
			"image": "http://kinlane-productions.s3.amazonaws.com/screen-capture-api/1013-getty-images.jpg",
			"humanURL": "http://www.gettyimages.com/",
			"baseURL": "https://api.gettyimages.com//",
			"tags": "Changes",
			"properties": [
				{
					"type": "x-openapi-spec",
					"url": "https://raw.githubusercontent.com/streamdata-gallery-topics/changes/master/_listings/getty-images/openapi.md"
				}
			]
		},
		{
			"name": "AWS CodeBuild",
			"x-api-slug": "aws-codebuild",
			"description": "AWS CodeBuild is a fully managed build service that compiles source code, runs tests, and produces software packages that are ready to deploy. With CodeBuild, you don&rsquo;t need to provision, manage, and scale your own build servers. CodeBuild scales continuously and processes multiple builds concurrently, so your builds are not left waiting in a queue. You can get started quickly by using prepackaged build environments, or you can create custom build environments that use your own build tools. With CodeBuild, you are charged by the minute for the compute resources you use.",
			"image": "http://kinlane-productions.s3.amazonaws.com/api-evangelist-site/company/logos/code-build-console-icon.png",
			"humanURL": "https://aws.amazon.com/codebuild/",
			"baseURL": ":///",
			"tags": "Changes",
			"properties": [
				{
					"type": "x-openapi-spec",
					"url": "https://raw.githubusercontent.com/streamdata-gallery-topics/changes/master/_listings/aws-codebuild/openapi.md"
				}
			]
		},
		{
			"name": "AWS CodeDeploy",
			"x-api-slug": "aws-codedeploy",
			"description": "AWS CodeDeploy is a service that automates code deployments to any instance, including Amazon EC2 instances and instances running on-premises. AWS CodeDeploy makes it easier for you to rapidly release new features, helps you avoid downtime during application deployment, and handles the complexity of updating your applications. You can use AWS CodeDeploy to automate software deployments, eliminating the need for error-prone manual operations, and the service scales with your infrastructure so you can easily deploy to one instance or thousands.",
			"image": "http://kinlane-productions.s3.amazonaws.com/api-evangelist-site/company/logos/aws-codedeploy.png",
			"humanURL": "https://aws.amazon.com/codedeploy/",
			"baseURL": ":///",
			"tags": "Changes",
			"properties": [
				{
					"type": "x-openapi-spec",
					"url": "https://raw.githubusercontent.com/streamdata-gallery-topics/changes/master/_listings/aws-codedeploy/openapi.md"
				}
			]
		},
		{
			"name": "AWS Identity and Access Management",
			"x-api-slug": "aws-identity-and-access-management",
			"description": "AWS Identity and Access Management (IAM) enables you to securely control access to AWS services and resources for your users. Using IAM, you can create and manage AWS users and groups, and use permissions to allow and deny their access to AWS resources.IAM is a feature of your AWS account offered at no additional charge. You will be charged only for use of other AWS services by your users.To get started using IAM, orif you have already registered with AWS, go to theAWS Management Consoleand get started with theseIAM Best Practices.",
			"image": "http://kinlane-productions.s3.amazonaws.com/api-evangelist-site/company/logos/Security-Identity_AWSIAM.png",
			"humanURL": "https://aws.amazon.com/iam/",
			"baseURL": ":///",
			"tags": "Changes",
			"properties": [
				{
					"type": "x-openapi-spec",
					"url": "https://raw.githubusercontent.com/streamdata-gallery-topics/changes/master/_listings/aws-identity-and-access-management/openapi.md"
				}
			]
		},
		{
			"name": "AWS API Gateway",
			"x-api-slug": "aws-api-gateway",
			"description": "Amazon API Gateway is a fully managed service that makes it easy for developers to create, publish, maintain, monitor, and secure APIs at any scale. With a few clicks in the AWS Management Console, you can create an API that acts as a front door for applications to access data, business logic, or functionality from your back-end services, such as workloads running on Amazon Elastic Compute Cloud, code running on AWS Lambda, or any Web application. Amazon API Gateway handles all the tasks involved in accepting and processing up to hundreds of thousands of concurrent API calls, including traffic management, authorization and access control, monitoring, and API version management. Amazon API Gateway has no minimum fees or startup costs. You pay only for the API calls you receive and the amount of data transferred out.",
			"image": "http://kinlane-productions.s3.amazonaws.com/api-evangelist-site/company/logos/aws-api-gateway-icon.png",
			"humanURL": "https://aws.amazon.com/api-gateway/",
			"baseURL": ":///",
			"tags": "Changes",
			"properties": [
				{
					"type": "x-openapi-spec",
					"url": "https://raw.githubusercontent.com/streamdata-gallery-topics/changes/master/_listings/aws-api-gateway/openapi.md"
				}
			]
		},
		{
			"name": "AWS Cognito",
			"x-api-slug": "aws-cognito",
			"description": "Amazon Cognito lets you easily add user sign-up and sign-in to your mobile and web apps. With Amazon Cognito, you also have the options to authenticate users through social identity providers such as Facebook, Twitter, or Amazon, with SAML identity solutions, or by using your own identity system. In addition, Amazon Cognito enables you to save data locally on users devices, allowing your applications to work even when the devices are offline. You can then synchronize data across users devices so that their app experience remains consistent regardless of the device they use. With Amazon Cognito, you can focus on creating great app experiences instead of worrying about building, securing, and scaling a solution to handle user management, authentication, and sync across devices.",
			"image": "http://kinlane-productions.s3.amazonaws.com/api-evangelist-site/company/logos/aws-cognito.png",
			"humanURL": "https://aws.amazon.com/cognito/",
			"baseURL": "https:///",
			"tags": "Changes",
			"properties": [
				{
					"type": "x-openapi-spec",
					"url": "https://raw.githubusercontent.com/streamdata-gallery-topics/changes/master/_listings/aws-cognito/openapi.md"
				}
			]
		},
		{
			"name": "AWS Simple Queue Service",
			"x-api-slug": "aws-simple-queue-service",
			"description": "Amazon Simple Queue Service (SQS) is a fast, reliable, scalable, fully managed message queuing service. Amazon SQS makes it simple and cost-effective to decouple the components of a cloud application. You can use Amazon SQS to transmit any volume of data, without losing messages or requiring other services to be always available. Amazon SQS includesstandard queueswith high throughput and at-least-once processing, andFIFO queuesthat provide FIFO (first-in, first-out) delivery and exactly-once processing. With Amazon SQS, you can offload the administrative burden of operating and scaling a highly available messaging cluster, while paying a low price for only what you use.",
			"image": "http://kinlane-productions.s3.amazonaws.com/api-evangelist-site/company/logos/Application-Services_AmazonSQS.png",
			"humanURL": "https://aws.amazon.com/sqs/",
			"baseURL": ":///",
			"tags": "Changes",
			"properties": [
				{
					"type": "x-openapi-spec",
					"url": "https://raw.githubusercontent.com/streamdata-gallery-topics/changes/master/_listings/aws-simple-queue-service/openapi.md"
				}
			]
		},
		{
			"name": "AWS WorkDocs",
			"x-api-slug": "aws-workdocs",
			"description": "Amazon WorkDocs is a fully managed, secure enterprise storage and sharing service with strong administrative controls and feedback capabilities that improve user productivity.Users can comment on files, send them to others for feedback, and upload new versions without having to resort to emailing multiple versions of their files as attachments. Users can take advantage of these capabilities wherever they are, using the device of their choice, including PCs, Macs, tablets and phones. Amazon WorkDocs offers IT administrators the option of integrating with existing corporate directories, flexible sharing policies and control of the location where data is stored. Customers can get started using Amazon WorkDocs with a 30-day free trial providing 1 TB of storage per user for up to 50 users.Amazon WorkDocs offers an Administrative SDK, currently in public preview. The Administrative SDK allows you to integrate your applications with Amazon WorkDocs by performing content and permissions updates, and managing users, programmatically. You can sign-up for the public preview here.",
			"image": "http://kinlane-productions.s3.amazonaws.com/api-evangelist-site/company/logos/Enterprise-Applications_AmazonWorkDocs.png",
			"humanURL": "https://aws.amazon.com/workdocs/",
			"baseURL": ":///",
			"tags": "Changes",
			"properties": [
				{
					"type": "x-openapi-spec",
					"url": "https://raw.githubusercontent.com/streamdata-gallery-topics/changes/master/_listings/aws-workdocs/openapi.md"
				}
			]
		},
		{
			"name": "AWS EC2",
			"x-api-slug": "aws-ec2",
			"description": "Amazon Elastic Compute Cloud is a web service that provides resizable compute capacity in the cloud. It is designed to make web-scale cloud computing easier for developers. Amazon EC2s simple web service interface allows you to obtain and configure capacity with minimal friction. It provides you with complete control of your computing resources and lets you run on Amazon&rsquo;s proven computing environment. Amazon EC2 reduces the time required to obtain and boot new server instances to minutes, allowing you to quickly scale capacity, both up and down, as your computing requirements change. Amazon EC2 changes the economics of computing by allowing you to pay only for capacity that you actually use. Amazon EC2 provides developers the tools to build failure resilient applications and isolate themselves from common failure scenarios.",
			"image": "http://kinlane-productions.s3.amazonaws.com/api-evangelist-site/company/logos/Compute_AmazonEC2.png",
			"humanURL": "https://aws.amazon.com/ec2/",
			"baseURL": ":///",
			"tags": "Changes",
			"properties": [
				{
					"type": "x-openapi-spec",
					"url": "https://raw.githubusercontent.com/streamdata-gallery-topics/changes/master/_listings/aws-ec2/openapi.md"
				}
			]
		},
		{
			"name": "AWS Route 53",
			"x-api-slug": "aws-route-53",
			"description": "Amazon Route 53 is a highly available and scalable cloud Domain Name System (DNS) web service. It is designed to give developers and businesses an extremely reliable and cost effective way to route end users to Internet applications by translating names like www.example.com into the numeric IP addresses like 192.0.2.1 that computers use to connect to each other. Amazon Route 53 is fully compliant with IPv6 as well.Amazon Route 53 effectively connects user requests to infrastructure running in AWS &ndash; such as Amazon EC2 instances, Elastic Load Balancing load balancers, or Amazon S3 buckets &ndash; and can also be used to route users to infrastructure outside of AWS. You can use Amazon Route 53 to configure DNS health checks to route traffic to healthy endpoints or to independently monitor the health of your application and its endpoints. Amazon Route 53 Traffic Flow makes it easy for you to manage traffic globally through a variety of routing types, including Latency Based Routing, Geo DNS, and Weighted Round Robin&mdash;all of which can be combined with DNS Failover in order to enable a variety of low-latency, fault-tolerant architectures. Using Amazon Route 53 Traffic Flow&rsquo;s simple visual editor, you can easily manage how your end-users are routed to your application&rsquo;s endpoints&mdash;whether in a single AWS region or distributed around the globe. Amazon Route 53 also offers Domain Name Registration &ndash; you can purchase and manage domain names such as example.com and Amazon Route 53 will automatically configure DNS settings for your domains.",
			"image": "http://kinlane-productions.s3.amazonaws.com/api-evangelist-site/company/logos/Networking_AmazonRoute53.png",
			"humanURL": "https://aws.amazon.com/route53/",
			"baseURL": ":///",
			"tags": "Changes",
			"properties": [
				{
					"type": "x-openapi-spec",
					"url": "https://raw.githubusercontent.com/streamdata-gallery-topics/changes/master/_listings/aws-route-53/openapi.md"
				}
			]
		},
		{
			"name": "Microsoft Graph",
			"x-api-slug": "microsoft-graph",
			"description": "Microsoft Graph exposes multiple APIs from Office 365 and other Microsoft cloud services through a single endpoint: https://graph.microsoft.com. Microsoft Graph simplifies queries that would otherwise be more complex. You can use Microsoft Graph to: Access data from multiple Microsoft cloud services, including Azure Active Directory, Exchange Online as part of Office 365, SharePoint, OneDrive, OneNote, and Planner. Navigate between entities and relationships. Access intelligence and insights from the Microsoft cloud (for commercial users).",
			"image": "http://kinlane-productions.s3.amazonaws.com/api-evangelist-site/company/logos/microsoft-graph.png",
			"humanURL": "https://developer.microsoft.com/en-us/graph/",
			"baseURL": "https://graph.microsoft.com//",
			"tags": "Changes",
			"properties": [
				{
					"type": "x-openapi-spec",
					"url": "https://raw.githubusercontent.com/streamdata-gallery-topics/changes/master/_listings/microsoft-graph/openapi.md"
				}
			]
		},
		{
			"name": "TradeStation",
			"x-api-slug": "tradestation",
			"description": "Whether you trade stocks, ETFs, options or futures, TradeStation???s award-winning tools and brokerage services can give you the confidence to achieve your goals.",
			"image": "http://kinlane-productions.s3.amazonaws.com/api-evangelist-site/company/logos/tradestation_logo_285x40.png",
			"humanURL": "http://www.tradestation.com",
			"baseURL": "https://api.tradestation.com//v2",
			"tags": "Changes",
			"properties": [
				{
					"type": "x-openapi-spec",
					"url": "https://raw.githubusercontent.com/streamdata-gallery-topics/changes/master/_listings/tradestation/openapi.md"
				}
			]
		},
		{
			"name": "Avaza",
			"x-api-slug": "avaza",
			"description": "Avaza is a beautiful online software suite with modules for Project Management, Timesheets, Expenses &amp; Invoicing. Access from anywhere, with any device. Avaza is the leading all-in-one software for running client focused businesses. Avaza allows businesses of all sizes to more easily and effectively manage team projects, time tracking, expense reporting, quoting &amp; invoicing. It can be accessed simply via a web browser from anywhere in the world on any device.",
			"image": "http://kinlane-productions.s3.amazonaws.com/screen-capture-api/28373-avaza.jpg",
			"humanURL": "https://www.avaza.com",
			"baseURL": "https:///",
			"tags": "Changes",
			"properties": [
				{
					"type": "x-openapi-spec",
					"url": "https://raw.githubusercontent.com/streamdata-gallery-topics/changes/master/_listings/avaza/openapi.md"
				}
			]
		},
		{
			"name": "Entertainment Express",
			"x-api-slug": "entertainment-express",
			"description": "Internet Video Archive (IVA) is a leading entertainment data company providing metadata, images and trailers/clips, for movie and TV content. With the launch of its award-winning Entertainment Express APIs, clients can easily access everything they need to create engaging content discovery experiences. By using Entertainment Express, clients can also connect to other services like movie showtimes and ticketing, content recommendations, content availability and TV channel line-ups. With over a million titles, episodes and over 150,000 videos available, IVA makes it easy for developers to integrate all the services they need at a very affordable price.",
			"image": "http://kinlane-productions.s3.amazonaws.com/api-evangelist-site/company/logos/IVA-logo.png",
			"humanURL": "https://www.internetvideoarchive.com/",
			"baseURL": "https://ee.iva-api.com//",
			"tags": "Changes",
			"properties": [
				{
					"type": "x-openapi-spec",
					"url": "https://raw.githubusercontent.com/streamdata-gallery-topics/changes/master/_listings/entertainment-express/openapi.md"
				}
			]
		},
		{
			"name": "Rebilly",
			"x-api-slug": "rebilly",
			"description": "",
			"image": "http://kinlane-productions.s3.amazonaws.com/api-evangelist-site/company/logos/rebilly.png",
			"humanURL": "https://www.rebilly.com",
			"baseURL": "https://api.rebilly.com//v2.1",
			"tags": "Changes",
			"properties": [
				{
					"type": "x-openapi-spec",
					"url": "https://raw.githubusercontent.com/streamdata-gallery-topics/changes/master/_listings/rebilly/openapi.md"
				}
			]
		},
		{
			"name": "BC Geographical Names",
			"x-api-slug": "bc-geographical-names",
			"description": "Geographical names are more than labels on maps and road signs. They can reveal patterns of settlement, exploration and migration, and mirror outside influences to our history - aspects of the heritage and promise of an area that might otherwise be overlooked or forgotten by visitors and later generations.",
			"image": "http://kinlane-productions.s3.amazonaws.com/api-evangelist-site/company/logos/british-columbia.png",
			"humanURL": "https://apps.gov.bc.ca/pub/bcgnws/",
			"baseURL": "https://apps.gov.bc.ca//pub/geomark",
			"tags": "Changes",
			"properties": [
				{
					"type": "x-openapi-spec",
					"url": "https://raw.githubusercontent.com/streamdata-gallery-topics/changes/master/_listings/bc-geographical-names/openapi.md"
				}
			]
		},
		{
			"name": "GitLab",
			"x-api-slug": "gitlab",
			"description": "GitLab is a web-based Git-repository manager with wiki, issue-tracking and CI/CD pipelines features, using an open-source license, developed by GitLab Inc.",
			"image": "http://kinlane-productions.s3.amazonaws.com/api-evangelist-site/company/logos/githlab-logo.png",
			"humanURL": "http://gitlab.com",
			"baseURL": "https://localhost:3000//api",
			"tags": "Changes",
			"properties": [
				{
					"type": "x-openapi-spec",
					"url": "https://raw.githubusercontent.com/streamdata-gallery-topics/changes/master/_listings/gitlab/openapi.md"
				}
			]
		},
		{
			"name": "Dezrez",
			"x-api-slug": "dezrez",
			"description": "Cloud based estate agent software , sales & letting agent software, estate agent website design and property management software - Dezrez  Services",
			"image": "http://kinlane-productions.s3.amazonaws.com/screen-capture-api/28888-www-dezrez-com.jpg",
			"humanURL": "https://www.dezrez.com",
			"baseURL": "https://api.dezrez.com//",
			"tags": "Changes",
			"properties": [
				{
					"type": "x-openapi-spec",
					"url": "https://raw.githubusercontent.com/streamdata-gallery-topics/changes/master/_listings/dezrez/openapi.md"
				}
			]
		}
	],
	"tags": "Changes",
	"include": [
		{
			"name": "Context.IO",
			"url": "https://raw.githubusercontent.com/streamdata-gallery-topics/changes/master/_listings/context-io/apis.yaml"
		},
		{
			"name": "Xignite",
			"url": "https://raw.githubusercontent.com/streamdata-gallery-topics/changes/master/_listings/xignite/apis.yaml"
		},
		{
			"name": "UK National Archives",
			"url": "https://raw.githubusercontent.com/streamdata-gallery-topics/changes/master/_listings/uk-national-archives/apis.yaml"
		},
		{
			"name": "Getty Images",
			"url": "https://raw.githubusercontent.com/streamdata-gallery-topics/changes/master/_listings/getty-images/apis.yaml"
		},
		{
			"name": "AWS CodeBuild",
			"url": "https://raw.githubusercontent.com/streamdata-gallery-topics/changes/master/_listings/aws-codebuild/apis.yaml"
		},
		{
			"name": "AWS CodeDeploy",
			"url": "https://raw.githubusercontent.com/streamdata-gallery-topics/changes/master/_listings/aws-codedeploy/apis.yaml"
		},
		{
			"name": "AWS Identity and Access Management",
			"url": "https://raw.githubusercontent.com/streamdata-gallery-topics/changes/master/_listings/aws-identity-and-access-management/apis.yaml"
		},
		{
			"name": "AWS API Gateway",
			"url": "https://raw.githubusercontent.com/streamdata-gallery-topics/changes/master/_listings/aws-api-gateway/apis.yaml"
		},
		{
			"name": "AWS Cognito",
			"url": "https://raw.githubusercontent.com/streamdata-gallery-topics/changes/master/_listings/aws-cognito/apis.yaml"
		},
		{
			"name": "AWS Simple Queue Service",
			"url": "https://raw.githubusercontent.com/streamdata-gallery-topics/changes/master/_listings/aws-simple-queue-service/apis.yaml"
		},
		{
			"name": "AWS WorkDocs",
			"url": "https://raw.githubusercontent.com/streamdata-gallery-topics/changes/master/_listings/aws-workdocs/apis.yaml"
		},
		{
			"name": "AWS EC2",
			"url": "https://raw.githubusercontent.com/streamdata-gallery-topics/changes/master/_listings/aws-ec2/apis.yaml"
		},
		{
			"name": "AWS Route 53",
			"url": "https://raw.githubusercontent.com/streamdata-gallery-topics/changes/master/_listings/aws-route-53/apis.yaml"
		},
		{
			"name": "Microsoft Graph",
			"url": "https://raw.githubusercontent.com/streamdata-gallery-topics/changes/master/_listings/microsoft-graph/apis.yaml"
		},
		{
			"name": "TradeStation",
			"url": "https://raw.githubusercontent.com/streamdata-gallery-topics/changes/master/_listings/tradestation/apis.yaml"
		},
		{
			"name": "Avaza",
			"url": "https://raw.githubusercontent.com/streamdata-gallery-topics/changes/master/_listings/avaza/apis.yaml"
		},
		{
			"name": "Entertainment Express",
			"url": "https://raw.githubusercontent.com/streamdata-gallery-topics/changes/master/_listings/entertainment-express/apis.yaml"
		},
		{
			"name": "Rebilly",
			"url": "https://raw.githubusercontent.com/streamdata-gallery-topics/changes/master/_listings/rebilly/apis.yaml"
		},
		{
			"name": "BC Geographical Names",
			"url": "https://raw.githubusercontent.com/streamdata-gallery-topics/changes/master/_listings/bc-geographical-names/apis.yaml"
		},
		{
			"name": "GitLab",
			"url": "https://raw.githubusercontent.com/streamdata-gallery-topics/changes/master/_listings/gitlab/apis.yaml"
		},
		{
			"name": "Dezrez",
			"url": "https://raw.githubusercontent.com/streamdata-gallery-topics/changes/master/_listings/dezrez/apis.yaml"
		}
	]
}